src/main/resources/tmi_perf_test.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: Monitoring-HealthCheck

scenarios:
  Monitoring-HealthCheck:
    think-time: 0.75
    requests:
      - http://AWS16143:10081/monitor/healthcheck

reporting:
  - module: final-stats
    summary: true
    percentiles: true
    test-duration: true
    dump-csv: tmi_perf_test.csv